app/controllers/comentarios_controller.rb

SELECT * FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
---
  def show
    @comentario = Comentario.find(params[:id])

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 4)
---
  def edit
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`updated_at`, `conteudo`, `comentavel_type`, `comentavel_id`, `created_at`) VALUES('2010-05-12 23:58:57', 'o restaurante não tem banheiro limpo', 'Restaurante', 1, '2010-05-12 23:58:57')
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 4)
UPDATE `comentarios` SET `conteudo` = 'Quali MUITO RUIM', `updated_at` = '2010-05-13 00:04:26' WHERE `id` = 4
---
  def update
    @comentario = Comentario.find(params[:id])

    respond_to do |format|
      if @comentario.update_attributes(params[:comentario])

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 2)
DELETE FROM `comentarios` WHERE `id` = 2
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy