app/controllers/restaurantes_controller.rb

  def index
#    @restaurantes = Restaurante.find(:all, :order => "nome")
    @restaurantes = Restaurante.paginate :page => params["page"], :per_page => 3
---
SELECT * FROM `restaurantes` ORDER BY nome
SELECT count(*) AS count_all FROM `restaurantes`

  def show
    @restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 5)

  def create
    @restaurante = Restaurante.new(params[:restaurante])
    if @restaurante.save
---
INSERT INTO `restaurantes` (`data_abertura`, `updated_at`, `especialidade`, `endereco`, `nome`, `created_at`) VALUES(NULL, '2010-05-11 02:19:39', 'todas', 'sem saida', 'Restaurante ademnir', '2010-05-11 02:19:39')

  def edit
    @restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 2)

  def update
    @restaurante = Restaurante.find(params[:id])
    if @restaurante.update_attributes(params[:restaurante])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 2)
UPDATE `restaurantes` SET `nome` = 'Anhembi Rest', `endereco` = 'Olavo Fontoura', `updated_at` = '2010-05-11 03:05:43' WHERE `id` = 6

  def destroy
    @restaurante = Restaurante.find(params[:id])
    @restaurante.destroy
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 5)
DELETE FROM `restaurantes` WHERE `id` = 5

  def busca
    @restaurantes = []
   @restaurantes << Restaurante.find_by_especialidade(params[:especialidade])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`especialidade` = 'Australina') LIMIT 1